
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьЗначениеТипПодключенияПринтера(TCP_IP)
  // Получаем значение перечисления по его имени
  Возврат Перечисления.ТипПодключенияПринтера.TCP_IP;
КонецФункции


//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ТипПодключенияПриИзменении(Элемент)
  Элементы.IPАдрес.Видимость = Ложь;
  
  ЗначениеТипПодключение = Элементы.ТипПодключения;
  
  ЗначениеTCPIP = ПолучитьЗначениеТипПодключенияПринтера("TCP_IP");
  
  Если ЗначениеТипПодключение = ЗначениеTCPIP Тогда
  	Элементы.IPАдрес.Видимость = Истина;
  Иначе
  	Элементы.IPАдрес.Видимость = Ложь;
  КонецЕсли	

КонецПроцедуры
