//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьЗначениеПеречисления(ИмяПеречисления, ИмяЗначения)
  // Возвращаем значение перечисления
  Возврат Перечисления[ИмяПеречисления][ИмяЗначения];
КонецФункции

//@skip-check module-structure-method-in-regions
&НаСервере
Процедура УстановитьВидимостьРеквизитов()
  // Получаем значение перечисления "TCP/IP" с сервера
  ЗначениеTCPIP = ПолучитьЗначениеПеречисления("ТипыПодключенияПринтеров", "TCP_IP");

  // Проверяем тип подключения
  Если Объект.ТипПодключения = ЗначениеTCPIP Тогда
    Элементы.IPАдрес.Видимость = Истина;
  Иначе
    Элементы.IPАдрес.Видимость = Ложь;
  КонецЕсли;

  // Проверяем вид оборудования
  Если Объект.ВидыОборудования = Справочники.ВидыОборудования.Принтер Тогда
    Элементы.МодельКартриджа.Видимость = Истина;
  Иначе
    Элементы.МодельКартриджа.Видимость = Ложь;
  КонецЕсли;
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ВидОборудованияПриИзменении(Элемент)
  УстановитьВидимостьРеквизитов();
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ТипПодключенияПриИзменении(Элемент)
  УстановитьВидимостьРеквизитов()
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПриОткрытии(Отказ)
  УстановитьВидимостьРеквизитов()
КонецПроцедуры