
//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура УстановитьВидимость()
	ТонкийКлиент = Объект.ТонкийКлиент;
	
	Элементы.Страницы.Видимость = НЕ ТонкийКлиент;
	Элементы.ОперционнаяСистема.Видимость = НЕ ТонкийКлиент;
	Элементы.Устройства.Видимость = НЕ ТонкийКлиент;
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ТонкийКлиентПриИзменении(Элемент)
	УстановитьВидимость()
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПриОткрытии(Отказ)
УстановитьВидимость();
КонецПроцедуры
