  /////////////////////////////////////
 //Заполнение табличной части Камеры//
/////////////////////////////////////
 
 //@skip-check module-structure-method-in-regions
 &НаСервере
Функция НайтиКамеру(IPАдрес)
  Возврат Справочники.Камеры.НайтиПоНаименованию(IPАдрес);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеКамеры(Камера)
	
	ДанныеКамеры = Новый Структура;
	
	ДанныеКамеры.Вставить("Производитель", Камера.Производитель);
	ДанныеКамеры.Вставить("Модель", Камера.Модель);
	ДанныеКамеры.Вставить("Логин", Камера.Логин);
	ДанныеКамеры.Вставить("Пароль", Камера.Пароль);
	ДанныеКамеры.Вставить("Порт", Камера.Порт);
	ДанныеКамеры.Вставить("Протокол", Камера.Протокол);
	
	Возврат ДанныеКамеры;
	
КонецФункции
 
 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура КамерыIPАдресПриИзменении(Элемент)
 	Камера = Элементы.Камеры.ТекущиеДанные;   
	
	ОбъектКамеры = НайтиКамеру(Камера.IPАдрес); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектКамеры <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеКамеры = ПолучитьДанныеКамеры(ОбъектКамеры);
    
    // Заполняем реквизиты табличной части
    Камера.Производитель = ДанныеКамеры.Производитель;
	Камера.Модель = ДанныеКамеры.Модель;
    Камера.Логин = ДанныеКамеры.Логин;
    Камера.Пароль = ДанныеКамеры.Пароль;
    Камера.Порт = ДанныеКамеры.Порт;
    Камера.Протокол = ДанныеКамеры.Протокол;
        
  КонецЕсли;
 	
 КонецПроцедуры





  ////////////////////////////////////////////////
 //Заполнение табличной части Видеорегистраторы//
////////////////////////////////////////////////
//@skip-check module-structure-method-in-regions
&НаСервере
Функция НайтиВидеорегистратор(СерийныйНомер)
  Возврат Справочники.Видеорегистраторы.НайтиПоНаименованию(СерийныйНомер);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеВидеорегистратора(Видеорегистратор)
	
	ДанныеВидеорегистратора = Новый Структура;
	
	ДанныеВидеорегистратора.Вставить("Производитель", Видеорегистратор.Производитель);
	ДанныеВидеорегистратора.Вставить("Модель", Видеорегистратор.Модель);
	ДанныеВидеорегистратора.Вставить("ИмяВидеорегистратора", Видеорегистратор.ИмяВидеорегистратора);
	ДанныеВидеорегистратора.Вставить("КоличествоКаналов", Видеорегистратор.КоличествоКаналов);
	
	Возврат ДанныеВидеорегистратора;
	
КонецФункции

 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура ВидеорегистраторыСерийныйНомерПриИзменении(Элемент)
 	Видеорегистратор = Элементы.Видеорегистраторы.ТекущиеДанные;   
	
	ОбъектВидеорегистратора = НайтиВидеорегистратор(Видеорегистратор.СерийныйНомер); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектВидеорегистратора <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеВидеорегистратора = ПолучитьДанныеВидеорегистратора(ОбъектВидеорегистратора);
    
    // Заполняем реквизиты табличной части
    Видеорегистратор.Производитель = ДанныеВидеорегистратора.Производитель;
	Видеорегистратор.Модель = ДанныеВидеорегистратора.Модель;
    Видеорегистратор.ИмяВидеорегистратора = ДанныеВидеорегистратора.ИмяВидеорегистратора;
    Видеорегистратор.КоличествоКаналов = ДанныеВидеорегистратора.КоличествоКаналов;
        
  КонецЕсли;
 	
 КонецПроцедуры





  //////////////////////////////////
 //Заполнение табличной части ТСД//
//////////////////////////////////
//@skip-check module-structure-method-in-regions
&НаСервере
Функция НайтиТСД(СерийныйНомер)
  Возврат Справочники.ТерминалыСбораДанных.НайтиПоНаименованию(СерийныйНомер);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеТСД(ТСД)
	
	ДанныеТСД = Новый Структура;
	
	ДанныеТСД.Вставить("Производитель", ТСД.Производитель);
	ДанныеТСД.Вставить("Модель", ТСД.Модель);
	ДанныеТСД.Вставить("Лицензия", ТСД.Лицензия);
	
	Возврат ДанныеТСД;
	
КонецФункции

 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура ТСДСерийныйНомерПриИзменении(Элемент)
 	ТСД = Элементы.ТерминалыСбораДанных.ТекущиеДанные;   
	
	ОбъектТСД = НайтиТСД(ТСД.СерийныйНомер); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектТСД <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеТСД = ПолучитьДанныеТСД(ОбъектТСД);
    
    // Заполняем реквизиты табличной части
    ТСД.Производитель = ДанныеТСД.Производитель;
	ТСД.Модель = ДанныеТСД.Модель;
    ТСД.Лицензия = ДанныеТСД.Лицензия;
    
  КонецЕсли;
 	
 КонецПроцедуры




  ///////////////////////////////////////
 //Заполнение табличной части Принтеры//
///////////////////////////////////////
//@skip-check module-structure-method-in-regions
&НаСервере
Функция НайтиПринтер(СерийныйНомер)
  Возврат Справочники.Принтеры.НайтиПоНаименованию(СерийныйНомер);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеПринтера(Принтер)
	
	ДанныеПринтера = Новый Структура;
	
	ДанныеПринтера.Вставить("Производитель", Принтер.Производитель);
	ДанныеПринтера.Вставить("Модель", Принтер.Модель);
	ДанныеПринтера.Вставить("ТипПринтера", Принтер.ТипПринтера);
	
	Возврат ДанныеПринтера;
	
КонецФункции

 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура ПринтерыСерийныйНомерПриИзменении(Элемент)
 	Принтер = Элементы.Принтеры.ТекущиеДанные;   
	
	ОбъектПринтера = НайтиПринтер(Принтер.СерийныйНомер); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектПринтера <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеПринтера = ПолучитьДанныеПринтера(ОбъектПринтера);
    
    // Заполняем реквизиты табличной части
    Принтер.Производитель = ДанныеПринтера.Производитель;
	Принтер.Модель = ДанныеПринтера.Модель;
    Принтер.ТипПринтера = ДанныеПринтера.ТипПринтера;
    
  КонецЕсли;
 	
 КонецПроцедуры



  ///////////////////////////////////////
 //Заполнение табличной части Мониторы//
///////////////////////////////////////
//@skip-check module-structure-method-in-regions
&НаСервере
Функция НайтиМонитор(СерийныйНомер)
  Возврат Справочники.Мониторы.НайтиПоНаименованию(СерийныйНомер);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеМонитора(Монитор)
	
	ДанныеМонитора = Новый Структура;
	
	ДанныеМонитора.Вставить("Производитель", Монитор.Производитель);
  	ДанныеМонитора.Вставить("Модель", Монитор.Модель);
  	ДанныеМонитора.Вставить("Размер", Монитор.Размер);
	
	Возврат ДанныеМонитора;
	
КонецФункции

 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура МониторыСерийныйНомерПриИзменении(Элемент)
 	Монитор = Элементы.Мониторы.ТекущиеДанные;   
	
	ОбъектМонитора = НайтиМонитор(Монитор.СерийныйНомер); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектМонитора <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеМонитора = ПолучитьДанныеМонитора(ОбъектМонитора);
    
    // Заполняем реквизиты табличной части
    Монитор.Производитель = ДанныеМонитора.Производитель;
    Монитор.Модель = ДанныеМонитора.Модель;
    Монитор.Размер = ДанныеМонитора.Размер;
    
  КонецЕсли;
 	
 КонецПроцедуры


  /////////////////////////////////
 //Заполнение табличной части ПК//
/////////////////////////////////

 //@skip-check module-structure-method-in-regions
 &НаСервере
Функция НайтиКомпьютер(ИмяПК)
  Возврат Справочники.Компьютеры.НайтиПоНаименованию(ИмяПК);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеКомпьютера(Компьютер)
	
	ДанныеКомпьютера = Новый Структура;
	
	ДанныеКомпьютера.Вставить("ОперационнаяСистема", Компьютер.ОперационнаяСистема);
  	ДанныеКомпьютера.Вставить("Процессор", Компьютер.Процессор);
  	ДанныеКомпьютера.Вставить("ТипОЗУ", Компьютер.ТипОЗУ);
	ДанныеКомпьютера.Вставить("КоличествоОЗУ", Компьютер.КоличествоОЗУ);
	ДанныеКомпьютера.Вставить("MACАдрес", Компьютер.MACАдрес);
	
	Возврат ДанныеКомпьютера;
	
КонецФункции


//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПКИмяПКПриИзменении(Элемент)
	Компьютер = Элементы.ПК.ТекущиеДанные;   
	
	ОбъектКомпьютера = НайтиКомпьютер(Компьютер.ИмяПК); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектКомпьютера <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеКомпьютера = ПолучитьДанныеКомпьютера(ОбъектКомпьютера);
    
    // Заполняем реквизиты табличной части
    Компьютер.ОперационнаяСистема = ДанныеКомпьютера.ОперационнаяСистема;
    Компьютер.Процессор = ДанныеКомпьютера.Процессор;
    Компьютер.ТипОЗУ = ДанныеКомпьютера.ТипОЗУ;
    Компьютер.КоличествоОЗУ = ДанныеКомпьютера.КоличествоОЗУ;
    Компьютер.MACАдрес = ДанныеКомпьютера.MACАдрес;
    
  КонецЕсли;

КонецПроцедуры

