  ///////////////////////////////////////
 //Заполнение табличной части Мониторы//
///////////////////////////////////////
//@skip-check module-structure-method-in-regions
&НаСервере
Функция НайтиМонитор(СерийныйНомер)
  Возврат Справочники.Мониторы.НайтиПоНаименованию(СерийныйНомер);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеМонитора(Монитор)
	
	ДанныеМонитора = Новый Структура;
	
	ДанныеМонитора.Вставить("Производитель", Монитор.Производитель);
  	ДанныеМонитора.Вставить("Модель", Монитор.Модель);
  	ДанныеМонитора.Вставить("Размер", Монитор.Размер);
	
	Возврат ДанныеМонитора;
	
КонецФункции

 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура МониторыСерийныйНомерПриИзменении(Элемент)
 	Монитор = Элементы.Мониторы.ТекущиеДанные;   
	
	ОбъектМонитора = НайтиМонитор(Монитор.СерийныйНомер); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектМонитора <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеМонитора = ПолучитьДанныеМонитора(ОбъектМонитора);
    
    // Заполняем реквизиты табличной части
    Монитор.Производитель = ДанныеМонитора.Производитель;
    Монитор.Модель = ДанныеМонитора.Модель;
    Монитор.Размер = ДанныеМонитора.Размер;
    
  КонецЕсли;
 	
 КонецПроцедуры


  /////////////////////////////////
 //Заполнение табличной части ПК//
/////////////////////////////////

 //@skip-check module-structure-method-in-regions
 &НаСервере
Функция НайтиКомпьютер(ИмяПК)
  Возврат Справочники.Компьютеры.НайтиПоНаименованию(ИмяПК);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеКомпьютера(Компьютер)
	
	ДанныеКомпьютера = Новый Структура;
	
	ДанныеКомпьютера.Вставить("ОперационнаяСистема", Компьютер.ОперационнаяСистема);
  	ДанныеКомпьютера.Вставить("Процессор", Компьютер.Процессор);
  	ДанныеКомпьютера.Вставить("ТипОЗУ", Компьютер.ТипОЗУ);
	ДанныеКомпьютера.Вставить("КоличествоОЗУ", Компьютер.КоличествоОЗУ);
	ДанныеКомпьютера.Вставить("MACАдрес", Компьютер.MACАдрес);
	
	Возврат ДанныеКомпьютера;
	
КонецФункции


//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПКИмяПКПриИзменении(Элемент)
	Компьютер = Элементы.ПК.ТекущиеДанные;   
	
	ОбъектКомпьютера = НайтиКомпьютер(Компьютер.ИмяПК); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектКомпьютера <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеКомпьютера = ПолучитьДанныеКомпьютера(ОбъектКомпьютера);
    
    // Заполняем реквизиты табличной части
    Компьютер.ОперационнаяСистема = ДанныеКомпьютера.ОперационнаяСистема;
    Компьютер.Процессор = ДанныеКомпьютера.Процессор;
    Компьютер.ТипОЗУ = ДанныеКомпьютера.ТипОЗУ;
    Компьютер.КоличествоОЗУ = ДанныеКомпьютера.КоличествоОЗУ;
    Компьютер.MACАдрес = ДанныеКомпьютера.MACАдрес;
    
  КонецЕсли;

КонецПроцедуры

