
  ///////////////////////////////////////
 //Заполнение табличной части ТСД//
///////////////////////////////////////
//@skip-check module-structure-method-in-regions
&НаСервере
Функция НайтиТСД(СерийныйНомер)
  Возврат Справочники.ТерминалыСбораДанных.НайтиПоНаименованию(СерийныйНомер);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеТСД(ТСД)
	
	ДанныеТСД = Новый Структура;
	
	ДанныеТСД.Вставить("Производитель", ТСД.Производитель);
	ДанныеТСД.Вставить("Модель", ТСД.Модель);
	ДанныеТСД.Вставить("MACАдрес", ТСД.MACАдрес);
	ДанныеТСД.Вставить("Лицензия", ТСД.Лицензия);
	
	Возврат ДанныеТСД;
	
КонецФункции

 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура ТСДСерийныйНомерПриИзменении(Элемент)
 	ТСД = Элементы.ТерминалыСбораДанных.ТекущиеДанные;   
	
	ОбъектТСД = НайтиТСД(ТСД.СерийныйНомер); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектТСД <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеТСД = ПолучитьДанныеТСД(ОбъектТСД);
    
    // Заполняем реквизиты табличной части
    ТСД.Производитель = ДанныеТСД.Производитель;
	ТСД.Производитель = ДанныеТСД.Модель;
    ТСД.Производитель = ДанныеТСД.MACАдрес;
    ТСД.Производитель = ДанныеТСД.Лицензия;
    
  КонецЕсли;
 	
 КонецПроцедуры




  ///////////////////////////////////////
 //Заполнение табличной части Принтеры//
///////////////////////////////////////
//@skip-check module-structure-method-in-regions
&НаСервере
Функция НайтиПринтер(СерийныйНомер)
  Возврат Справочники.Принтеры.НайтиПоНаименованию(СерийныйНомер);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеПринтера(Принтер)
	
	ДанныеПринтера = Новый Структура;
	
	ДанныеПринтера.Вставить("Производитель", Принтер.Производитель);
	ДанныеПринтера.Вставить("Модель", Принтер.Модель);
	ДанныеПринтера.Вставить("ТипПринтера", Принтер.ТипПринтера);
	ДанныеПринтера.Вставить("ТипПодключения", Принтер.ТипПодключения);
	ДанныеПринтера.Вставить("МодельКартриджа", Принтер.МодельКартриджа);
	
	Возврат ДанныеПринтера;
	
КонецФункции

 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура ПринтерыСерийныйНомерПриИзменении(Элемент)
 	Принтер = Элементы.Принтеры.ТекущиеДанные;   
	
	ОбъектПринтера = НайтиПринтер(Принтер.СерийныйНомер); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектПринтера <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеПринтера = ПолучитьДанныеПринтера(ОбъектПринтера);
    
    // Заполняем реквизиты табличной части
    Принтер.Производитель = ДанныеПринтера.Производитель;
	Принтер.Производитель = ДанныеПринтера.Модель;
    Принтер.Производитель = ДанныеПринтера.ТипПринтера;
    Принтер.Производитель = ДанныеПринтера.ТипПодключения;
    Принтер.Производитель = ДанныеПринтера.МодельКартриджа;
    
  КонецЕсли;
 	
 КонецПроцедуры



  ///////////////////////////////////////
 //Заполнение табличной части Мониторы//
///////////////////////////////////////
//@skip-check module-structure-method-in-regions
&НаСервере
Функция НайтиМонитор(СерийныйНомер)
  Возврат Справочники.Мониторы.НайтиПоНаименованию(СерийныйНомер);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеМонитора(Монитор)
	
	ДанныеМонитора = Новый Структура;
	
	ДанныеМонитора.Вставить("Производитель", Монитор.Производитель);
  	ДанныеМонитора.Вставить("Модель", Монитор.Модель);
  	ДанныеМонитора.Вставить("Размер", Монитор.Размер);
	
	Возврат ДанныеМонитора;
	
КонецФункции

 //@skip-check module-structure-method-in-regions
 &НаКлиенте
 Процедура МониторыСерийныйНомерПриИзменении(Элемент)
 	Монитор = Элементы.Мониторы.ТекущиеДанные;   
	
	ОбъектМонитора = НайтиМонитор(Монитор.СерийныйНомер); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектМонитора <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеМонитора = ПолучитьДанныеМонитора(ОбъектМонитора);
    
    // Заполняем реквизиты табличной части
    Монитор.Производитель = ДанныеМонитора.Производитель;
    Монитор.Модель = ДанныеМонитора.Модель;
    Монитор.Размер = ДанныеМонитора.Размер;
    
  КонецЕсли;
 	
 КонецПроцедуры


  /////////////////////////////////
 //Заполнение табличной части ПК//
/////////////////////////////////

 //@skip-check module-structure-method-in-regions
 &НаСервере
Функция НайтиКомпьютер(ИмяПК)
  Возврат Справочники.Компьютеры.НайтиПоНаименованию(ИмяПК);
КонецФункции
 
//@skip-check module-structure-method-in-regions
&НаСервере
Функция ПолучитьДанныеКомпьютера(Компьютер)
	
	ДанныеКомпьютера = Новый Структура;
	
	ДанныеКомпьютера.Вставить("ОперационнаяСистема", Компьютер.ОперационнаяСистема);
  	ДанныеКомпьютера.Вставить("Процессор", Компьютер.Процессор);
  	ДанныеКомпьютера.Вставить("ТипОЗУ", Компьютер.ТипОЗУ);
	ДанныеКомпьютера.Вставить("КоличествоОЗУ", Компьютер.КоличествоОЗУ);
	ДанныеКомпьютера.Вставить("MACАдрес", Компьютер.MACАдрес);
	
	Возврат ДанныеКомпьютера;
	
КонецФункции


//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПКИмяПКПриИзменении(Элемент)
	Компьютер = Элементы.ПК.ТекущиеДанные;   
	
	ОбъектКомпьютера = НайтиКомпьютер(Компьютер.ИмяПК); 
	
	// Если компьютер найден, получаем данные
  Если ОбъектКомпьютера <> Неопределено Тогда
    
    // Получаем структуру с данными компьютера
    ДанныеКомпьютера = ПолучитьДанныеКомпьютера(ОбъектКомпьютера);
    
    // Заполняем реквизиты табличной части
    Компьютер.ОперационнаяСистема = ДанныеКомпьютера.ОперационнаяСистема;
    Компьютер.Процессор = ДанныеКомпьютера.Процессор;
    Компьютер.ТипОЗУ = ДанныеКомпьютера.ТипОЗУ;
    Компьютер.КоличествоОЗУ = ДанныеКомпьютера.КоличествоОЗУ;
    Компьютер.MACАдрес = ДанныеКомпьютера.MACАдрес;
    
  КонецЕсли;

КонецПроцедуры

