
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Для Каждого СтрокаРабочихМест Из РабочиеМеста Цикл
        РабочееМесто = СтрокаРабочихМест.РабочееМесто;
        НовыйОтветственный = СтрокаРабочихМест.НовыйОтветственный;
        НовоеПодразделение = СтрокаРабочихМест.НовоеПодразделение; // Получаем значение НовоеПодразделение

        Если ЗначениеЗаполнено(РабочееМесто) И ЗначениеЗаполнено(НовыйОтветственный) Тогда

            ДокРабочееМесто = РабочееМесто.ПолучитьОбъект();
            ДокРабочееМесто.Ответственный = НовыйОтветственный;

            // Проверяем заполнено ли НовоеПодразделение
            Если ЗначениеЗаполнено(НовоеПодразделение) Тогда
                // Если заполнено, то обновляем Подразделение в ДокРабочееМесто
                ДокРабочееМесто.Подразделение = НовоеПодразделение;
            КонецЕсли;

            ДокРабочееМесто.Записать(РежимЗаписиДокумента.Проведение);

        КонецЕсли;
    КонецЦикла;

КонецПроцедуры
