Процедура ОбработкаПроведения(Отказ, РежимПроведения)

  Для Каждого СтрокаОтветственных Из НовыеОтветственные Цикл
    РабочееМесто = СтрокаОтветственных.РабочееМесто;
    НовыйОтветственный = СтрокаОтветственных.НовыйОтветственный;

    Если ЗначениеЗаполнено(РабочееМесто) И ЗначениеЗаполнено(НовыйОтветственный) Тогда
      
      ДокРабочееМесто = РабочееМесто.ПолучитьОбъект();
      ДокРабочееМесто.Ответственный = НовыйОтветственный;
      ДокРабочееМесто.Записать(РежимЗаписиДокумента.Проведение);
      
    КонецЕсли;
  КонецЦикла;
	Сообщить("Пупа");
КонецПроцедуры